# 取り組んだ課題一覧
- ブログ作成(optparseについて)
- タイピング
- Rubyでカレンダーを作る
- ゴルフのスコア判定プログラム
- Linucの問題集(Lv1-101) 10問

# わかったこと
- Ruby
    - `cwday`は月曜日を1で返し、日曜日を7で返すこと。`wday`は日曜日を0で返し、月曜日を1で返すこと。
    - `printf`で`%2d`を指定すれば数字が1桁の場合、半角スペース数字となる。
    - ハッシュのキーに数字が指定できること。その際には、{1 => 'hoge'}みたいに`=>`で指定可能だが、シンボルでは指定できない。

- Linux
    - cd ~ユーザ名で指定したユーザ名のホームディレクトリに移動できる。

# 次やること
- タイピング
- Linucの問題集(Lv1-101)
- ブログ作成(チェリー本を読んだ感想)
- ゴルフのスコア判定プログラム

# 感じたこと
- optparseに関する公式ドキュメントを読んでみましたが、ドキュメントを読むだけでなく、プログラムを動かすことによって、理解が深まりました。また、ドキュメントに記載されているコードを少し変えて動かすことで、ドキュメントでは説明されていなかったことについても知ることができました。

- コードを書き出す前に処理フローを言葉で書いてから、コーディングをすることでロジックを考える力を鍛えたいです。

# 学習時間
Today: 4 h 30 m

Total: 265 h 00 m




















